got the mermaid conversion done
